app/views/orders/edit.html.erb

        <% if @class == Service %>
        <% @i = Item.where("order_id = ? AND service_id = ?", @order.id, order.id).first  %>
---
SELECT `items`.* FROM `items` WHERE (order_id = 3 AND service_id = 3) ORDER BY `items`.`id` ASC LIMIT 1