app/views/orders/index.html.erb

SELECT COUNT(*) FROM `services` INNER JOIN `service_orders` ON `services`.`id` = `service_orders`.`service_id` WHERE `service_orders`.`order_id` = 1
SELECT COUNT(*) FROM `supplies` INNER JOIN `supply_orders` ON `supplies`.`id` = `supply_orders`.`supply_id` WHERE `supply_orders`.`order_id` = 1
---
        <td><%= @month[order.refers_month] %></td>
        <td><%= order.services.length %></td>
        <td><%= order.supplies.length %></td>