app/controllers/categories_controller.rb

INSERT INTO "categories" ("created_at", "name", "updated_at") VALUES (?, ?, ?)  [["created_at", Fri, 18 Oct 2013 20:59:07 UTC +00:00], ["name", "Serviço de Reparo"], ["updated_at", Fri, 18 Oct 2013 20:59:07 UTC +00:00]]
---
  def create
    @category = Category.new(category_params)

    respond_to do |format|
      if @category.save