app/controllers/items_controller.rb

INSERT INTO `items` (`created_at`, `order_id`, `qty`, `supply_id`, `updated_at`) VALUES ('2013-10-24 20:37:15', 2, 23, 2, '2013-10-24 20:37:15')
---
  def create
    @item = Item.new(item_params)
    unless @item.service_id.nil?
      @sorder = @item.service
      @kind = "srv"
    else
      @sorder = @item.supply
      @kind = "sup"
    end

    respond_to do |format|
      if @item.save