app/controllers/itens_controller.rb

  def create
    @item = Item.new(item_params)

    respond_to do |format|
      if @item.save
---
INSERT INTO `items` (`created_at`, `order_id`, `service_id`, `updated_at`) VALUES ('2013-10-23 20:53:02', 2, 1, '2013-10-23 20:53:02')

    def set_order
      @item = Item.find(params[:id])
---
SELECT `items`.* FROM `items` WHERE `items`.`id` = 36 LIMIT 1