app/controllers/orders_controller.rb

  def index
    @orders = Order.all.includes(:services, :supplies)
---
SELECT `orders`.* FROM `orders`
SELECT `services`.* FROM `services` WHERE `services`.`id` IN (1)
SELECT `supplies`.* FROM `supplies` WHERE `supplies`.`id` IN (1)

  def create
    @order = Order.new(order_params)
    @orders = Order.all

    respond_to do |format|
      if @order.save
---
SELECT `orders`.* FROM `orders`
INSERT INTO "orders" ("created_at", "refers_month", "updated_at") VALUES (?, ?, ?)  [["created_at", Sun, 20 Oct 2013 14:15:17 UTC +00:00], ["refers_month", 3], ["updated_at", Sun, 20 Oct 2013 14:15:17 UTC +00:00]]

  def update
    respond_to do |format|
      if @order.update(order_params)
---
UPDATE `orders` SET `refers_month` = 4, `updated_at` = '2013-10-21 20:43:26' WHERE `orders`.`id` = 1

  def destroy
    @order.destroy
---
DELETE FROM `orders` WHERE `orders`.`id` = 1

  def find_item
    @services = Service.where("description LIKE ?", "%#{params[:item]}%")
    @supplies = Supply.where("description LIKE ?", "%#{params[:item]}%")

    @result_sv = @services.map do |sv|
---
SELECT `items`.* FROM `items` WHERE (order_id = 3 AND service_id = 3) ORDER BY `items`.`id` ASC LIMIT 1
SELECT `services`.* FROM `services` WHERE (description LIKE '%teste%')
SELECT `supplies`.* FROM `supplies` WHERE (description LIKE '%tes%')
SELECT `items`.* FROM `items` ORDER BY `items`.`id` ASC LIMIT 1
SELECT `services`.* FROM `services`