app/controllers/services_controller.rb

SELECT `categories`.* FROM `categories` WHERE `categories`.`id` IN (1)
---
  def index
    year = params[:year]
    unless year
      @services = Service.where('year = ?', Date.today.strftime("%Y")).includes(:category)

SELECT `categories`.* FROM `categories`
---
  def new
    @service = Service.new
    # Shows current and next year
    @supplies = [Date.today.year, Date.today.year + 1]
    @categories = Category.all

SELECT `categories`.* FROM `categories`
---
  def edit
    @categories = Category.all

INSERT INTO `services` (`category_id`, `created_at`, `description`, `qty`, `updated_at`, `value`) VALUES (1, '2013-10-20 15:12:19', 'oaisdioads', 1231, '2013-10-20 15:12:19', 1231245.0)
---
  def create
    @service = Service.new(service_params)

    respond_to do |format|
      if @service.save

UPDATE `services` SET `description` = 'aaab', `updated_at` = '2013-10-24 20:23:04' WHERE `services`.`id` = 2
---
  def update
    respond_to do |format|
      if @service.update(service_params)

DELETE FROM `services` WHERE `services`.`id` = 1
---
  def destroy
    @service.destroy