app/controllers/supplies_controller.rb

SELECT `supplies`.* FROM `supplies`
---
  def index
    @supplies = Supply.all(include: "category")

SELECT `categories`.* FROM `categories`
---
  def new
    @supply = Supply.new
    @categories = Category.all

SELECT `categories`.* FROM `categories`
---
  def edit
    @categories = Category.all

INSERT INTO "supplies" ("created_at", "description", "qty", "unit", "updated_at", "value") VALUES (?, ?, ?, ?, ?, ?)  [["created_at", Fri, 18 Oct 2013 17:44:01 UTC +00:00], ["description", "Teste"], ["qty", 234], ["unit", "213"], ["updated_at", Fri, 18 Oct 2013 17:44:01 UTC +00:00], ["value", 1]]
---
  def create
    @supply = Supply.new(supply_params)
    @categories = Category.all

    respond_to do |format|
      if @supply.save

UPDATE "supplies" SET "value" = ?, "updated_at" = ? WHERE "supplies"."id" = 1  [["value", 423], ["updated_at", Fri, 18 Oct 2013 20:52:43 UTC +00:00]]
---
  def update
    respond_to do |format|
      if @supply.update(supply_params)

DELETE FROM `supplies` WHERE `supplies`.`id` = 6
---
  def destroy
    @supply.destroy

SELECT "supplies".* FROM "supplies" WHERE "supplies"."id" = ? LIMIT 1  [["id", "1"]]
---
    def set_supply
      @supply = Supply.find(params[:id])