app/controllers/supplies_controller.rb

  def index
    year = params[:year]
    unless year
      @supplies = Supply.where('year = ?', Date.today.strftime("%Y")).includes(:category)
---
SELECT `categories`.* FROM `categories` WHERE `categories`.`id` IN (1)